# OPERATING EXCELS FILES

In [1]:
import pandas as pd 
import numpy as np

pip install xlrd

pip install openpyxl

In [2]:
data = pd.read_excel('data.xlsx')

In [3]:
data

   train no.  marks     city
0      12345     92   rampur
1       6789    134  kolkata
2       9845    224  sendhwa
3      88787     17    warla

In [4]:
data = pd.read_excel('data.xlsx',sheet_name='Sheet1')

In [5]:
data

   train no.  marks     city
0      12345     92   rampur
1       6789    134  kolkata
2       9845    224  sendhwa
3      88787     17    warla

In [6]:
data = pd.read_excel('data.xlsx',sheet_name='Sheet2')

In [7]:
data

   train no. 2  marks 2   city 2
0        12345       92   rampur
1         6789      134  kolkata
2         9845      224  sendhwa
3        88787       17    warla

In [8]:
data.iloc[0,0] = 34

In [9]:
data

   train no. 2  marks 2   city 2
0           34       92   rampur
1         6789      134  kolkata
2         9845      224  sendhwa
3        88787       17    warla